wataru1023-dev/esp32s3-switch-pro-bridge/esp32s3-switch-pro-bridge/sdkconfig.defaults
# ESP32-S3-N16R8 target defaults.
# PENDING_HARDWARE_TEST: build, flash, USB enumeration, and PSRAM config must be verified on the real board.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_FREERTOS_HZ=1000
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_BT_ENABLED=y
CONFIG_BT_BLE_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_INTERNAL=y
CONFIG_TINYUSB_HID_COUNT=2
CONFIG_TINYUSB_VENDOR_COUNT=1
CONFIG_TINYUSB_DEBUG_LEVEL=2
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MEMMAP=y
# CONFIG_SPIRAM_USE_MALLOC is not set
# CONFIG_SPIRAM_MEMTEST is not set
